Autodesk.Revit.DB.Analysis.VectorAtPoint.#ctor(Autodesk.Revit.DB.Analysis.VectorAtPoint)
Creates a copy of the given VectorAtPoint instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.VectorAtPoint.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates object from an array of vectors
vectors:
Array of vectors, each corresponding to "measurement"
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied vectors contain invalid (infinite or non-number) coordinates
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.VectorAtPoint
Stores vectors at one domain point.
Each vector corresponds to a "measurement" for which this vector was calculated.
Since:
2012